<template>
  <v-app>
    <v-main>
      1. Отображение информации о пользователе
      <br />
      <!-- TODO сделать в отдельном блоке отображение информации о выбранном пользователе с использование v-card -->
      2. Выбор пользователя
      <br />
      <!-- TODO используйте v-autocomplete для выбора пользователя -->
      3. Редактирование пользователя
      <!-- TODO добавить возможность редактировать данные пользователя -->
    </v-main>
  </v-app>
</template>

<script>
export default {
  name: "App",

  data: () => ({}),

  methods: {
    getUsers() {
      // TODO получить список пользователей отсюда
      // https://fakerapi.it/api/v1/persons?_locale=ru_RU
    },
  },
};
</script>
